<template>
  <v-main>
    <h1><b>ToDo</b>modoro</h1>
    <h2>Что это?</h2>
    <p>
      Личный помошник в структурировании списка дел. Функциональный дизайн
      проекта был продуман под вдохновлением от
      <a href="https://www.youtube.com/c/MaximDorofeev"
        >материалов замечательного человека Максима Дорофеева.</a
      >
      Данная инструкция является краткой выжимкой его материалов
    </p>
    <h2>Как пользоваться?</h2>

    <p>Разделите список дел на отдельные сущности:</p>

    <ul>
      <li>Задача</li>
      <li>Проект</li>
      <li>Заметка/идея</li>
    </ul>

    <p>
      Проект может состоять из задач, подпроектов, заметка/идея и двух
      дополнительных сущностей (этапы и отчеты)
    </p>
    <h2>Заметка/Идея</h2>
    <p>
      Часто человек, вздлянув на свой список дел(который только растет) мнит
      себя ужасным прокрастинатором и испытывает чувство вины. Однако не все
      дела действительно требуют выполнения. Также сюда можно вносить справочную
      информацию, которая в дальнейшем поможет в формулировании и выполнении
      задач
    </p>
    <h2>Задача</h2>
    <p>
      Если же мы поняли, что перед нами дело, которое делать надо, то начнем
      формулировать задачу. Однако в правильной формулировке задачи лежим 50%
      успеха по ее выполнению. Чтобы задача была правильно сформулитована, она
      должна удовлетворять следующим критериям:
    </p>
    <ul>
      <li>
        Описывать то что надо СДЕЛАТЬ, т.е. начинаться с глагола в неопределеной
        форме (вымыть/купить/прочитать/написать/принести/попросить и т.д.)
      </li>
      <li>ГДЕ я буду это делать (место/приложение/учебник/сайт)</li>
      <li>
        Какой критерий завершенности задачи (30 слов/ 20 минут/ 50 упражнений)
      </li>
      <li>С чего начать выполнение задачи</li>
      <li>
        Выполняться за примерно 30 минут в "полмозга" (вы уже подумали над
        задачей во время формулировки)
      </li>
    </ul>
    <h2>Проект</h2>
    <p>
      Если задачу точно надо делать, но она не укладывается в критерии, значит
      ее требуется декомпозировать(разбить на меньшие и более конкретные
      задачи). Для этого и нужны проекты - они позволяют собрать вместе
      маленькие шаги, видущие к выполнению одного большого дела
    </p>
    <h2>Этапы</h2>
    <p>
      Не стоит пуать этапы проекта с задачами. Этапы определяются, скорее, как
      критерии завершенности проекта. Количество задач, которые требуется
      выполнить, чтобы закрыть определеный этап невозможно предугадать
    </p>
    <h2>Отчеты</h2>
    <p>Позволяют оценить здоровие проекта и примерные сроки завершения</p>
    <h2>Рекомендации</h2>
    <ul>
      <li>
        Пользуйтесь приложением постоянно. Если задачи только записывать но не
        просматривать, то делаться ничего не будет (:
      </li>
      <li>
        Не формируйте скрытый список задач. Записывайте все задачи в одно место
        и выполняйте задачи только оттуда
      </li>
      <li>
        Не пытайтесь продумать все задачи сразу. Пополняйте список по мере
        необходимости, а еще лучше активнее пользуйтесь вкладкой "идеи и
        заметки"
      </li>
      <li>
        Раз в неделю просмотрите плоский список всех задач и перенесите их в
        категорию "На неделе". Проверьте отчеты по проектам: успеваите ли по
        срокам, забываете ли что-то важное
      </li>
      <li>Вечером, перед сном переносите недельные задачи на завтра</li>
      <li>
        Когда приступаете к работе, отсортируйте только сегодняшние задачи,
        чтобы остальные не отвлекали
      </li>
    </ul>
    <router-link to="/">Приступим</router-link>
  </v-main>
</template>
